alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "adc.h"
#include "crc.h"
#include "dcmi.h"
#include "dma.h"
#include "dma2d.h"
#include "eth.h"
#include "fatfs.h"
#include "i2c.h"
#include "ltdc.h"
#include "quadspi.h"
#include "rtc.h"
#include "sai.h"
#include "sdmmc.h"
#include "spdifrx.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "usb_host.h"
#include "gpio.h"
#include "fmc.h"
#include "app_touchgfx.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32746g_discovery_audio.h"
#include <stdio.h>
#include <string.h>
#include <math.h>
#include "ff.h"
#include "arm_math.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
FATFS SDFatFs;

#define AUDIO_BUFFER_SIZE   8192
#define AUDIO_HALF_BUFFER   (AUDIO_BUFFER_SIZE / 2)
FIL WavFile;
uint8_t AudioBuffer[AUDIO_BUFFER_SIZE];
volatile uint32_t AudioRemainingBytes = 0;
volatile uint8_t  AudioPlaying = 0;
volatile uint8_t  HalfBufferNeedsFill = 0;
volatile uint8_t  FullBufferNeedsFill = 0;
volatile uint8_t AudioTrackFinished = 0;
volatile uint8_t EQEnabled = 1;
volatile uint8_t EchoEnabled = 1;
volatile uint8_t echoResetPending = 0;

extern volatile uint8_t AudioVolume;

#define FFT_SIZE 1024
#define FFT_BANDS 16
#define EQ_BLOCK_SIZE 1024
#define EQ_BAND_COUNT 5
#define BIQUAD_COEFFS_PER_STAGE 5
#define BIQUAD_STATE_PER_STAGE 4
#define EQ_MAX_HEADROOM_DB 6.0f
#define EQ_LIMITER_THRESHOLD 32000.0f
#define EQ_LIMITER_RELEASE 0.05f

#define ECHO_BUFFER_ADDRESS 0xC0100000U
#define ECHO_MAX_SAMPLE_RATE 48000U
#define ECHO_MAX_DELAY_MS 500U
#define ECHO_DELAY_MS 280U
#define ECHO_CHANNEL_COUNT 2U
#define ECHO_MIX 0.28f
#define ECHO_FEEDBACK 0.37f
#define ECHO_MAX_DELAY_SAMPLES \
    ((ECHO_MAX_SAMPLE_RATE * ECHO_MAX_DELAY_MS) / 1000U)
#define ECHO_BUFFER_FLOAT_COUNT \
    (ECHO_MAX_DELAY_SAMPLES * ECHO_CHANNEL_COUNT)

float32_t fftBands[FFT_BANDS];
float32_t fftBandsSmoothed[FFT_BANDS];
float32_t fftInput[FFT_SIZE];
float32_t fftOutput[FFT_SIZE];
float32_t fftMagnitude[FFT_SIZE / 2];
float32_t hannWindow[FFT_SIZE];

static const float32_t eqBandFrequencies[EQ_BAND_COUNT] =
{
    100.0f,
    300.0f,
    1000.0f,
    3000.0f,
    8000.0f
};

float32_t eqBandGainsDB[EQ_BAND_COUNT] =
{
    0.0f,   // 100 Hz
    0.0f,   // 300 Hz
    0.0f,   // 1 kHz
    0.0f,   // 3 kHz
    0.0f    // 8 kHz
};

volatile float32_t eqRequestedGainsDB[EQ_BAND_COUNT] =
{
    0.0f,
    0.0f,
    0.0f,
    0.0f,
    0.0f
};
volatile uint8_t eqUpdatePending = 0;
float32_t eqSampleRate = 48000.0f;
float32_t eqPreampGain = 1.0f;
float32_t eqLimiterGain = 1.0f;

float32_t eqCoeffs[EQ_BAND_COUNT * BIQUAD_COEFFS_PER_STAGE];
float32_t eqStateLeft[EQ_BAND_COUNT * BIQUAD_STATE_PER_STAGE];
float32_t eqStateRight[EQ_BAND_COUNT * BIQUAD_STATE_PER_STAGE];
float32_t eqLeftBuffer[EQ_BLOCK_SIZE];
float32_t eqRightBuffer[EQ_BLOCK_SIZE];

static float32_t *const echoBuffer =
    (float32_t *)ECHO_BUFFER_ADDRESS;
static uint32_t echoIndex = 0;
static uint32_t echoDelaySamples = 1;

arm_rfft_fast_instance_f32 fftInstance;
arm_biquad_casd_df1_inst_f32 eqLeft;
arm_biquad_casd_df1_inst_f32 eqRight;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
void MX_FREERTOS_Init(void);
/* USER CODE BEGIN PFP */
static void SDRAM_Initialization_Sequence(SDRAM_HandleTypeDef *hsdram);

uint8_t WavPlayer_Start(const char *filename);
void WavPlayer_FillHalf(uint8_t *half);

void AudioFFT_Process(uint8_t *audioData);

void AudioEQ_Init(float32_t sampleRate);
void AudioEQ_Process(uint8_t *audioData);
void AudioEQ_SetBandGain(uint8_t band, float32_t gainDB);
void AudioEcho_SetEnabled(uint8_t enabled);
uint8_t AudioEcho_IsEnabled(void);
static void AudioEQ_CalculateCoefficients(void);
static void AudioEQ_UpdatePreampGain(void);
static void AudioEQ_ApplyPendingGains(void);
static void AudioEQ_ApplyLimiter(void);
static void AudioEcho_Init(float32_t sampleRate);
static void AudioEcho_Reset(void);
static void AudioEcho_Process(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC3_Init();
  MX_CRC_Init();
  MX_DCMI_Init();
  MX_DMA2D_Init();
  MX_ETH_Init();
  MX_FMC_Init();
  SDRAM_Initialization_Sequence(&hsdram1);
  MX_I2C1_Init();
  MX_I2C3_Init();
  MX_LTDC_Init();
  HAL_GPIO_WritePin(GPIOI, GPIO_PIN_12, GPIO_PIN_SET); // LCD_DISP
  HAL_GPIO_WritePin(GPIOK, GPIO_PIN_3, GPIO_PIN_SET);  // Backlight

  SCB_CleanDCache_by_Addr((uint32_t *)0xC0000000, 480 * 272 * 2);
  __DSB();
  __ISB();

  HAL_LTDC_SetAddress(&hltdc, 0xC0000000, LTDC_LAYER_1);
  HAL_LTDC_Reload(&hltdc, LTDC_RELOAD_IMMEDIATE);
  MX_QUADSPI_Init();
  MX_RTC_Init();
  MX_SAI2_Init();
  MX_SDMMC1_SD_Init();
  MX_SPDIFRX_Init();
  MX_SPI2_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM5_Init();
  MX_TIM8_Init();
  MX_TIM12_Init();
  MX_USART1_UART_Init();
  MX_USART6_UART_Init();
  MX_FATFS_Init();
  MX_TouchGFX_Init();
  /* Call PreOsInit function */
  MX_TouchGFX_PreOSInit();
  /* USER CODE BEGIN 2 */
  if (arm_rfft_fast_init_f32(&fftInstance, FFT_SIZE) != ARM_MATH_SUCCESS)
  {
      printf("FFT init failed\r\n");
      Error_Handler();
  }
  for (uint32_t i = 0; i < FFT_SIZE; i++)
  {
      hannWindow[i] =
          0.5f *
          (1.0f -
           cosf((2.0f * PI * i) / (FFT_SIZE - 1)));
  }
  /* USER CODE END 2 */

