alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
  uint8_t foundFmt = 0, foundData = 0;
  uint16_t audioFormat = 0, numChannels = 0, bitsPerSample = 0, blockAlign = 0;
  uint32_t sampleRate = 0, byteRate = 0;
  uint32_t dataSize = 0;

  /* Walk chunks until we find both "fmt " and "data" */
  while (!foundData)
  {
    res = f_read(&WavFile, chunkId, 4, &bytesread);
    if (res != FR_OK || bytesread != 4)
    {
      printf("Failed to read chunk id (EOF before data chunk found)\r\n");
      f_close(&WavFile);
      return 0;
    }

    res = f_read(&WavFile, &chunkSize, 4, &bytesread);
    if (res != FR_OK || bytesread != 4)
    {
      printf("Failed to read chunk size\r\n");
      f_close(&WavFile);
      return 0;
    }

    printf("Found chunk '%.4s' size=%lu\r\n", chunkId, (unsigned long)chunkSize);

    if (strncmp(chunkId, "fmt ", 4) == 0)
    {
      FSIZE_t fmtChunkStart = f_tell(&WavFile);

      f_read(&WavFile, &audioFormat, 2, &bytesread);
      f_read(&WavFile, &numChannels, 2, &bytesread);
      f_read(&WavFile, &sampleRate, 4, &bytesread);
      f_read(&WavFile, &byteRate, 4, &bytesread);
      f_read(&WavFile, &blockAlign, 2, &bytesread);
      f_read(&WavFile, &bitsPerSample, 2, &bytesread);

      f_lseek(&WavFile, fmtChunkStart + chunkSize);
      foundFmt = 1;
    }
    else if (strncmp(chunkId, "data", 4) == 0)
    {
      dataSize = chunkSize;
      foundData = 1;
    }
    else
    {
      FSIZE_t currentPos = f_tell(&WavFile);
      f_lseek(&WavFile, currentPos + chunkSize);
    }
  }

  if (!foundFmt)
  {
    printf("No fmt chunk found!\r\n");
    f_close(&WavFile);
    return 0;
  }

  printf("AudioFormat=%u NumChannels=%u SampleRate=%lu BitsPerSample=%u DataSize=%lu\r\n",
         audioFormat, numChannels, (unsigned long)sampleRate, bitsPerSample, (unsigned long)dataSize);

  if (audioFormat != 1)
  {
    printf("Not PCM format!\r\n");
    f_close(&WavFile);
    return 0;
  }

  AudioRemainingBytes = dataSize;
  AudioEQ_Init((float32_t)sampleRate);
  printf("Calling BSP_AUDIO_OUT_Init with sampleRate=%lu\r\n", (unsigned long)sampleRate);
  audio_status = BSP_AUDIO_OUT_Init(
      OUTPUT_DEVICE_HEADPHONE,
      AudioVolume,
      sampleRate
  );
  if (audio_status != AUDIO_OK)
  {
    printf("BSP_AUDIO_OUT_Init failed, status=%u\r\n", audio_status);
    f_close(&WavFile);
    return 0;
  }
  BSP_AUDIO_OUT_SetAudioFrameSlot(CODEC_AUDIOFRAME_SLOT_02);
  printf("Audio codec init OK\r\n");

  f_read(&WavFile, AudioBuffer, AUDIO_BUFFER_SIZE, &bytesread);
  if (bytesread < AUDIO_BUFFER_SIZE)
  {
    memset(&AudioBuffer[bytesread], 0, AUDIO_BUFFER_SIZE - bytesread);
  }
  AudioRemainingBytes -= bytesread;

  AudioEQ_Process(&AudioBuffer[0]);

  AudioEQ_Process(
      &AudioBuffer[AUDIO_HALF_BUFFER]
  );

  printf("Initial buffer filled, bytesread=%u\r\n", bytesread);

  AudioPlaying = 1;

  audio_status = BSP_AUDIO_OUT_Play((uint16_t *)AudioBuffer, AUDIO_BUFFER_SIZE);
  if (audio_status != AUDIO_OK)
  {
    printf("BSP_AUDIO_OUT_Play failed, status=%u\r\n", audio_status);
    BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
    AudioPlaying = 0;
    f_close(&WavFile);
    return 0;
  }
  printf("Playback started!\r\n");

  return 1;
}

static void AudioEQ_CalculateCoefficients(void)
{
    const float32_t Q = 1.0f;

    for (uint32_t band = 0; band < EQ_BAND_COUNT; band++)
    {
        float32_t frequency = eqBandFrequencies[band];
        float32_t gainDB = eqBandGainsDB[band];
        float32_t A = powf(10.0f, gainDB / 40.0f);
        float32_t omega = 2.0f * PI * frequency / eqSampleRate;
        float32_t alpha = sinf(omega) / (2.0f * Q);
        float32_t cosOmega = cosf(omega);

        float32_t b0 = 1.0f + alpha * A;
        float32_t b1 = -2.0f * cosOmega;
        float32_t b2 = 1.0f - alpha * A;
        float32_t a0 = 1.0f + alpha / A;
        float32_t a1 = -2.0f * cosOmega;
        float32_t a2 = 1.0f - alpha / A;

        uint32_t coeffIndex = band * BIQUAD_COEFFS_PER_STAGE;

        eqCoeffs[coeffIndex] = b0 / a0;
        eqCoeffs[coeffIndex + 1] = b1 / a0;
        eqCoeffs[coeffIndex + 2] = b2 / a0;

        /* CMSIS-DSP DF1 expects the feedback coefficients with inverted signs. */
        eqCoeffs[coeffIndex + 3] = -(a1 / a0);
        eqCoeffs[coeffIndex + 4] = -(a2 / a0);
    }
}

static void AudioEQ_UpdatePreampGain(void)
{
    float32_t maxBoostDB = 0.0f;

    for (uint32_t band = 0; band < EQ_BAND_COUNT; band++)
    {
        if (eqBandGainsDB[band] > maxBoostDB)
        {
            maxBoostDB = eqBandGainsDB[band];
        }
    }

    float32_t headroomDB = maxBoostDB;

    if (headroomDB > EQ_MAX_HEADROOM_DB)
    {
        headroomDB = EQ_MAX_HEADROOM_DB;
    }

    eqPreampGain = powf(10.0f, -headroomDB / 20.0f);
}

void AudioEQ_Init(float32_t sampleRate)
{
    eqSampleRate = sampleRate;
    AudioEcho_Init(sampleRate);

    for (uint32_t band = 0; band < EQ_BAND_COUNT; band++)
    {
        eqBandGainsDB[band] = eqRequestedGainsDB[band];
    }

    eqUpdatePending = 0;
    eqLimiterGain = 1.0f;
    AudioEQ_UpdatePreampGain();
    AudioEQ_CalculateCoefficients();

    arm_biquad_cascade_df1_init_f32(
        &eqLeft,
        EQ_BAND_COUNT,
        eqCoeffs,
        eqStateLeft
    );

    arm_biquad_cascade_df1_init_f32(
        &eqRight,
        EQ_BAND_COUNT,
        eqCoeffs,
        eqStateRight
    );
}

void AudioEQ_SetBandGain(uint8_t band, float32_t gainDB)
{
    if (band >= EQ_BAND_COUNT)
    {
        return;
    }

    if (gainDB < -12.0f)
    {
        gainDB = -12.0f;
    }
    else if (gainDB > 12.0f)
    {
        gainDB = 12.0f;
    }

    eqRequestedGainsDB[band] = gainDB;
    eqUpdatePending = 1;
}

static void AudioEQ_ApplyPendingGains(void)
{
    if (!eqUpdatePending)
    {
        return;
    }

    eqUpdatePending = 0;

    for (uint32_t band = 0; band < EQ_BAND_COUNT; band++)
    {
        eqBandGainsDB[band] = eqRequestedGainsDB[band];
    }

    AudioEQ_UpdatePreampGain();
    AudioEQ_CalculateCoefficients();
}

static void AudioEQ_ApplyLimiter(void)
{
    float32_t peak = 0.0f;

