alifarzanehrad/stm32-audio-dsp-player/Core/Src/main.c
    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        float32_t leftPeak = fabsf(eqLeftBuffer[i]);
        float32_t rightPeak = fabsf(eqRightBuffer[i]);

        if (leftPeak > peak)
        {
            peak = leftPeak;
        }

        if (rightPeak > peak)
        {
            peak = rightPeak;
        }
    }

    float32_t targetGain = 1.0f;

    if (peak > EQ_LIMITER_THRESHOLD)
    {
        targetGain = EQ_LIMITER_THRESHOLD / peak;
    }

    if (targetGain < eqLimiterGain)
    {
        eqLimiterGain = targetGain;
    }
    else
    {
        eqLimiterGain +=
            EQ_LIMITER_RELEASE * (targetGain - eqLimiterGain);
    }

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        eqLeftBuffer[i] *= eqLimiterGain;
        eqRightBuffer[i] *= eqLimiterGain;
    }
}

void AudioEcho_SetEnabled(uint8_t enabled)
{
    uint8_t newState = enabled ? 1U : 0U;

    if (EchoEnabled != newState)
    {
        EchoEnabled = newState;
        echoResetPending = 1U;
    }
}

uint8_t AudioEcho_IsEnabled(void)
{
    return EchoEnabled;
}

static void AudioEcho_Reset(void)
{
    echoIndex = 0U;

    memset(
        echoBuffer,
        0,
        ECHO_BUFFER_FLOAT_COUNT * sizeof(float32_t)
    );
}

static void AudioEcho_Init(float32_t sampleRate)
{
    uint32_t requestedSamples =
        (uint32_t)((sampleRate * ECHO_DELAY_MS) / 1000.0f);

    if (requestedSamples < 1U)
    {
        requestedSamples = 1U;
    }
    else if (requestedSamples > ECHO_MAX_DELAY_SAMPLES)
    {
        requestedSamples = ECHO_MAX_DELAY_SAMPLES;
    }

    echoDelaySamples = requestedSamples;
    AudioEcho_Reset();
}

static void AudioEcho_Process(void)
{
    const float32_t dryMix = 1.0f - ECHO_MIX;

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        uint32_t bufferIndex = echoIndex * ECHO_CHANNEL_COUNT;

        float32_t dryLeft = eqLeftBuffer[i];
        float32_t dryRight = eqRightBuffer[i];
        float32_t delayedLeft = echoBuffer[bufferIndex];
        float32_t delayedRight = echoBuffer[bufferIndex + 1U];

        /* y[n] = (1-M)x[n] + M d[n] */
        eqLeftBuffer[i] =
            dryMix * dryLeft + ECHO_MIX * delayedLeft;
        eqRightBuffer[i] =
            dryMix * dryRight + ECHO_MIX * delayedRight;

        /* b[n] = x[n] + F d[n] */
        echoBuffer[bufferIndex] =
            dryLeft + ECHO_FEEDBACK * delayedLeft;
        echoBuffer[bufferIndex + 1U] =
            dryRight + ECHO_FEEDBACK * delayedRight;

        echoIndex++;

        if (echoIndex >= echoDelaySamples)
        {
            echoIndex = 0U;
        }
    }
}

void AudioEQ_Process(uint8_t *audioData)
{
    if (echoResetPending)
    {
        echoResetPending = 0U;
        AudioEcho_Reset();
    }

    if (!EQEnabled && !EchoEnabled)
    {
        return;
    }

    AudioEQ_ApplyPendingGains();

    int16_t *samples =
        (int16_t *)audioData;
    float32_t inputGain =
        EQEnabled ? eqPreampGain : 1.0f;

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        eqLeftBuffer[i] =
            (float32_t)samples[2 * i] * inputGain;

        eqRightBuffer[i] =
            (float32_t)samples[2 * i + 1] * inputGain;
    }

    if (EQEnabled)
    {
        arm_biquad_cascade_df1_f32(
            &eqLeft,
            eqLeftBuffer,
            eqLeftBuffer,
            EQ_BLOCK_SIZE
        );

        arm_biquad_cascade_df1_f32(
            &eqRight,
            eqRightBuffer,
            eqRightBuffer,
            EQ_BLOCK_SIZE
        );
    }

    if (EchoEnabled)
    {
        AudioEcho_Process();
    }

    AudioEQ_ApplyLimiter();

    for (uint32_t i = 0; i < EQ_BLOCK_SIZE; i++)
    {
        float32_t left = eqLeftBuffer[i];
        float32_t right = eqRightBuffer[i];

        if (left > 32767.0f)
            left = 32767.0f;

        if (left < -32768.0f)
            left = -32768.0f;

        if (right > 32767.0f)
            right = 32767.0f;

        if (right < -32768.0f)
            right = -32768.0f;

        samples[2 * i] =
            (int16_t)left;

        samples[2 * i + 1] =
            (int16_t)right;
    }
}

void AudioFFT_Process(uint8_t *audioData)
{
    int16_t *samples = (int16_t *)audioData;

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        int32_t left  = samples[2 * i];
        int32_t right = samples[2 * i + 1];

        fftInput[i] = ((float32_t)left + (float32_t)right) * 0.5f;
    }

    float32_t mean = 0.0f;

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        mean += fftInput[i];
    }

    mean /= FFT_SIZE;

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        fftInput[i] -= mean;
    }

    for (uint32_t i = 0; i < FFT_SIZE; i++)
    {
        fftInput[i] *= hannWindow[i];
    }

    arm_rfft_fast_f32(
        &fftInstance,
        fftInput,
        fftOutput,
        0
    );

    fftMagnitude[0] = fabsf(fftOutput[0])/ FFT_SIZE;

    for (uint32_t k = 1; k < FFT_SIZE / 2; k++)
    {
        float32_t real = fftOutput[2 * k];
        float32_t imag = fftOutput[2 * k + 1];

        fftMagnitude[k] =
            sqrtf(real * real + imag * imag)/ FFT_SIZE;
    }

    uint32_t maxBin = 1;
    float32_t maxMagnitude = fftMagnitude[1];

    for (uint32_t k = 2; k < FFT_SIZE / 2; k++)
    {
        if (fftMagnitude[k] > maxMagnitude)
        {
            maxMagnitude = fftMagnitude[k];
            maxBin = k;
        }
    }
    static const uint16_t bandEdges[FFT_BANDS + 1] =
    {
        1,
        2,
        3,
        4,
        6,
        9,
        13,
        19,
        28,
        41,
        60,
        88,
        129,
        189,
        277,
        405,
        511
    };

    for (uint32_t band = 0; band < FFT_BANDS; band++)
    {
        float32_t sum = 0.0f;

        uint32_t startBin = bandEdges[band];
        uint32_t endBin   = bandEdges[band + 1];

        for (uint32_t k = startBin; k < endBin; k++)
        {
            sum += fftMagnitude[k];
        }

        uint32_t count = endBin - startBin;

        if (count > 0)
        {
            fftBands[band] = sum / (float32_t)count;
        }
        else
        {
            fftBands[band] = 0.0f;
        }
    }
    float32_t maxBand = 1.0f;

    for (uint32_t band = 0; band < FFT_BANDS; band++)
    {
        if (fftBands[band] > maxBand)
        {
            maxBand = fftBands[band];
        }
    }

    for (uint32_t band = 0; band < FFT_BANDS; band++)
    {
        float32_t normalized =
            (fftBands[band] / maxBand) * 100.0f;

        if (normalized > 100.0f)
        {
            normalized = 100.0f;
        }

